Autodesk.Revit.Exceptions.InvalidOperationException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.InvalidOperationException
The exception that is thrown when a method call is invalid for the object's current state.